Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: هذا ما توعدون ليوم الحساب
en: This it is what you (Al-Muttaqun - the pious - see V.2:2) are promised for the Day of Reckoning!

source: إن هذا لرزقنا ما له من نفاد
en: (It will be said to them)! Verily, this is Our Provision which will never finish.

source: هذا وإن للطاغين لشر مآب
en: This is so! And for the Taghun (transgressors, the disobedient to Allah and His Messenger - disbelievers in the Oneness of Allah, criminals) will be an evil final return (Fire).

source: جهنم يصلونها فبئس المهاد
en: Hell! Where they will burn, and worst (indeed) is that place to rest!

source: هذا فليذوقوه حميم وغساق
en: This is so! Then let them taste it - a boiling fluid and dirty wound discharges.

source: وآخر من شكله أزواج
en: And other (torments) of similar kind - all together!

source: هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالو النار
en: This is a troop entering with you (in Hell), no welcome for them! Verily, they shall burn in the Fire!

source: قالوا بل أنتم لا مرحبا بكم أنتم قدمتموه لنا فبئس القرار
en: (The followers of the misleaders will say): "Nay, you (too)! No welcome for you! It is you (misleaders) who brought this upon us (because you misled us in the world), so evil is this place to stay in!"

source: قالوا ربنا من قدم لنا هذا فزده عذابا ضعفا في النار
en: They will say: "Our Lord! Whoever brought this upon us, add to him a double torment in the Fire!"

source: وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار
en: And they will say: "What is the matter with us that we see not men whom we used to count among the bad ones?"

source: أتخذناهم سخريا أم زاغت عنهم الأبصار
en: Did we take them as an object of mockery, or have (our) eyes failed to perceive them?"

source: إن ذلك لحق تخاصم أهل النار
en: Verily, that is the very truth - the mutual dispute of the people of the Fire!

source: قل إنما أنا منذر وما من إله إلا الله الواحد القهار
en: Say (O Muhammad صلى الله عليه وسلم): "I am only a warner and there is no Ilah (God) except Allah (none has the right to be worshipped but Allah) the One, the Irresistible,

source: رب السماوات والأرض وما بينهما العزيز الغفار
en: "The Lord of the heavens and the earth and all that is between them, the All-Mighty, the Oft-Forgiving."

source: قل هو نبأ عظيم
en: Say: "That (this Qur'an) is a great news,

source: أنتم عنه معرضون
en: "From which you turn away!

source: ما كان لي من علم بالملإ الأعلى إذ يختصمون
en: "I had no knowledge of the chiefs (angels) on high when they were disputing and discussing (about the creation of Adam).

source: إن يوحى إلي إلا أنما أنا نذير مبين
en: "Only this has been revealed to me, that I am a plain warner."

source: إذ قال ربك للملائكة إني خالق بشرا من طين
en: (Remember) when your Lord said to the angels: "Truly I am going to create man from clay".

source: إلا إبليس استكبر وكان من الكافرين
en: Except Iblis (Satan): he was proud and was one of the disbelievers.

source: قال يا إبليس ما منعك أن تسجد لما خلقت بيدي أستكبرت أم كنت من العالين
en: (Allah) said: "O Iblis (Satan)! What prevents you from prostrating yourself to one whom I have created with Both My Hands . Are you too proud (to fall prostrate to Adam) or are you one of the high exalted?"

source: قال أنا خير منه خلقتني من نار وخلقته من طين
en: [Iblis (Satan)] said: "I am better than he. You created me from fire, and You created him from clay."

source: وإن عليك لعنتي إلى يوم الدين
en: "And verily My Curse is on you till the Day of Recompense."

source: قال فبعزتك لأغوينهم أجمعين
en: [Iblis (Satan)] said: "By Your Might, then I will surely mislead them all,

source: قال فالحق والحق أقول
en: (Allah) said: "The Truth is - and the Truth I say -

source: لأملأن جهنم منك وممن تبعك منهم أجمعين
en: That I will fill Hell with you [Iblis (Satan)] and those of them (mankind) that follow you, together."

source: قل ما أسألكم عليه من أجر وما أنا من المتكلفين
en: Say (O Muhammad صلى الله عليه وسلم): "No wage do I ask of you for this (the Qur'an), nor am I one of the Mutakallifun (those who pretend and fabricate things which do not exist).

source: إن هو إلا ذكر للعالمين
en: "It (this Qur'an) is only a Reminder for all the 'Alamin (mankind and jinn).

source: ولتعلمن نبأه بعد حين
en: "And you shall certainly know the truth of it after a while".

source: تنزيل الكتاب من الله العزيز الحكيم
en: The revelation of this Book (the Qur'an) is from Allah, the All-Mighty, the All-Wise.

source: إنا أنزلنا إليك الكتاب بالحق فاعبد الله مخلصا له الدين
en: Verily We have sent down the Book to you (O Muhammad صلى الله عليه وسلم) in truth: So worship Allah (Alone) by doing religious deeds sincerely for Allah's sake only.

source: ألا لله الدين الخالص والذين اتخذوا من دونه أولياء ما نعبدهم إلا ليقربونا إلى الله زلفى إن الله يحكم بينهم في ما هم فيه يختلفون إن الله لا يهدي من هو كاذب كفار
en: Surely the religion (i.e. the worship and the obedience) is for Allah only. And those who take Auliya' (protectors, helpers, lords, gods) besides Him (say): "We worship them only that they may bring us near to Allah." Verily Allah will judge between them concerning that wherein they differ. Truly, Allah guides not him who is a liar, and a disbeliever.

source: لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار
en: Had Allah willed to take a son (or offspring), He could have chosen whom He willed out of those whom He created. But glory be to Him! (He is above such things). He is Allah, the One, the Irresistible .

source: خلق السماوات والأرض بالحق يكور الليل على النهار ويكور النهار على الليل وسخر الشمس والقمر كل يجري لأجل مسمى ألا هو العزيز الغفار
en: He has created the heavens and the earth with truth. He makes the night to go in the day and makes the day to go in the night. And He has subjected the sun and the moon. Each running (on a fixed course) for an appointed term. Verily, He is the All-Mighty, the Oft-Forgiving.

source: خلقكم من نفس واحدة ثم جعل منها زوجها وأنزل لكم من الأنعام ثمانية أزواج يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث ذلكم الله ربكم له الملك لا إله إلا هو فأنى تصرفون
en: He created you (all) from a single person (Adam); then made from him his wife [Hawwa' (Eve)]. And He has sent down for you of cattle eight pairs (of the sheep, two, male and female; of the goats, two, male and female; of the oxen, two, male and female; and of the camels, two, male and female). He creates you in the wombs of your mothers: creation after creation in three veils of darkness. Such is Allah your Lord. His is the kingdom. La ilaha illa Huwa (none has the right to be worshipped but He). How then are you turned away?

source: إن تكفروا فإن الله غني عنكم ولا يرضى لعباده الكفر وإن تشكروا يرضه لكم ولا تزر وازرة وزر أخرى ثم إلى ربكم مرجعكم فينبئكم بما كنتم تعملون إنه عليم بذات الصدور
en: If you disbelieve, then verily, Allah is not in need of you; He likes not disbelief for His slaves. And if you are grateful (by being believers), He is pleased therewith for you. No bearer of burdens shall bear the burden of another. Then to your Lord is your return, and He will inform you what you used to do. Verily, He is the All-Knower of that which is in (men's) breasts.

source: وإذا مس الإنسان ضر دعا ربه منيبا إليه ثم إذا خوله نعمة منه نسي ما كان يدعو إليه من قبل وجعل لله أندادا ليضل عن سبيله قل تمتع بكفرك قليلا إنك من أصحاب النار
en: And when some hurt touches man, he cries to his Lord (Allah Alone), turning to Him in repentance. But when He bestows a favour upon him from Himself, he forgets that for which he cried for before, and he sets up rivals to Allah, in order to mislead others from His Path. Say: "Take pleasure in your disbelief for a while: surely you are (one) of the dwellers of the Fire!"

source: أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه قل هل يستوي الذين يعلمون والذين لا يعلمون إنما يتذكر أولو الألباب
en: Is one who is obedient to Allah, prostrating himself or standing (in prayer) during the hours of the night, fearing the Hereafter and hoping for the Mercy of his Lord (like one who disbelieves)? Say: "Are those who know equal to those who know not?" It is only men of understanding who will remember (i.e. get a lesson from Allah's Signs and Verses).

source: قل يا عباد الذين آمنوا اتقوا ربكم للذين أحسنوا في هذه الدنيا حسنة وأرض الله واسعة إنما يوفى الصابرون أجرهم بغير حساب
en: Say (O Muhammad صلى الله عليه وسلم): "O My slaves who believe (in the Oneness of Allah - Islamic Monotheism), be afraid of your Lord (Allah) and keep your duty to Him. Good is (the reward) for those who do good in this world, and Allah's earth is spacious (so if you cannot worship Allah at a place, then go to another)! Only those who are patient shall receive their reward in full, without reckoning. "

source: قل إني أمرت أن أعبد الله مخلصا له الدين
en: Say (O Muhammad صلى الله عليه وسلم): "Verily I am commanded to worship Allah (Alone) by obeying Him and doing religious deeds sincerely for His sake only.

source: وأمرت لأن أكون أول المسلمين
en: "And I am commanded (this) in order that I may be the first of those who submit themselves to Allah (in Islam) as Muslims."

source: قل الله أعبد مخلصا له ديني
en: Say (O Muhammad صلى الله عليه وسلم): "Allah Alone I worship by doing religious deeds sincerely for His sake only (and not to show off, and not to set up rivals with Him in worship.)"

source: فاعبدوا ما شئتم من دونه قل إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا ذلك هو الخسران المبين
en: So worship what you like besides Him. Say (O Muhammad صلى الله عليه وسلم): "The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!"

source: لهم من فوقهم ظلل من النار ومن تحتهم ظلل ذلك يخوف الله به عباده يا عباد فاتقون
en: They shall have coverings of Fire, above them and covering (of Fire) beneath them. With this Allah does frighten His slaves: "O My slaves, therefore fear Me!"

source: والذين اجتنبوا الطاغوت أن يعبدوها وأنابوا إلى الله لهم البشرى فبشر عباد
en: Those who avoid At-Taghut (false deities) by not worshipping them and turn to Allah (in repentance), for them are glad tidings; so announce the good news to My slaves -

source: الذين يستمعون القول فيتبعون أحسنه أولئك الذين هداهم الله وأولئك هم أولو الألباب
en: Those who listen to the Word [good advice La ilaha illallah - (none has the right to be worshipped but Allah) and Islamic Monotheism] and follow the best thereof (i.e. worship Allah Alone, repent to Him and avoid Taghut) those are (the ones) whom Allah has guided and those are men of understanding.

source: أفمن حق عليه كلمة العذاب أفأنت تنقذ من في النار
en: Is, then one against whom the Word of punishment is justified (equal to the one who avoids evil)? Will you (O Muhammad صلى الله عليه وسلم) rescue him who is in the Fire?

source: لكن الذين اتقوا ربهم لهم غرف من فوقها غرف مبنية تجري من تحتها الأنهار وعد الله لا يخلف الله الميعاد
en: But those who fear their Lord (Allah) and keep their duty to Him, for them are built lofty rooms, one above another under which rivers flow (i.e. Paradise). (This is) the Promise of Allah: and Allah does not fail in (His) Promise.

source: ألم تر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض ثم يخرج به زرعا مختلفا ألوانه ثم يهيج فتراه مصفرا ثم يجعله حطاما إن في ذلك لذكرى لأولي الألباب
en: See you not that Allah sends down water (rain) from the sky, and causes it to penetrate the earth, (and then makes it to spring up) as water-springs, and afterward thereby produces crops of different colours, and afterward they wither and you see them turn yellow; then He makes them dry and broken pieces. Verily, in this is a Reminder for men of understanding.

source: أفمن شرح الله صدره للإسلام فهو على نور من ربه فويل للقاسية قلوبهم من ذكر الله أولئك في ضلال مبين
en: Is he whose breast Allah has opened to Islam, so that he is in light from His Lord (as he who is a non-Muslim)? So woe to those whose hearts are hardened against remembrance of Allah! They are in plain error!

source: الله نزل أحسن الحديث كتابا متشابها مثاني تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله ذلك هدى الله يهدي به من يشاء ومن يضلل الله فما له من هاد
en: Allah has sent down the Best Statement, a Book (this Qur'an), its parts resembling each other (in goodness and truth) (and) oft-repeated. The skins of those who fear their Lord shiver from it (when they recite it or hear it). Then their skin and their heart soften to the remembrance of Allah. That is the guidance of Allah. He Guides therewith whom He wills; and whomever Allah sends astray, for him there is no guide.

source: أفمن يتقي بوجهه سوء العذاب يوم القيامة وقيل للظالمين ذوقوا ما كنتم تكسبون
en: Is he then, who will confront with his face the awful torment on the Day of Resurrection (as he who enters peacefully in Paradise)? And it will be said to the Zalimun (polytheists and wrong-doers): "Taste what you used to earn!"

source: كذب الذين من قبلهم فأتاهم العذاب من حيث لا يشعرون
en: Those before them belied, and so the torment came on them from directions they perceived not.

source: فأذاقهم الله الخزي في الحياة الدنيا ولعذاب الآخرة أكبر لو كانوا يعلمون
en: So Allah made them to taste the disgrace in the present life, but greater is the torment of the Hereafter if they only knew!

source: ولقد ضربنا للناس في هذا القرآن من كل مثل لعلهم يتذكرون
en: And indeed We have put forth for men, in this Qur'an every kind of similitude in order that they may remember.

source: قرآنا عربيا غير ذي عوج لعلهم يتقون
en: An Arabic Qur'an, without any crookedness (therein) in order that they may avoid all evil which Allah has ordered them to avoid, fear Him and keep their duty to Him.

source: ضرب الله مثلا رجلا فيه شركاء متشاكسون ورجلا سلما لرجل هل يستويان مثلا الحمد لله بل أكثرهم لا يعلمون
en: Allah puts forth a similitude: a (slave) man belonging to many partners (like those who worship others along with Allah) disputing with one another, and a (slave) man belonging entirely to one master (like those who worship Allah Alone). Are those two equal in comparison? All the praises and thanks be to Allah! But most of them know not.

source: إنك ميت وإنهم ميتون
en: Verily you (O Muhammad صلى الله عليه وسلم) will die, and verily they (too) will die.

source: ثم إنكم يوم القيامة عند ربكم تختصمون
en: Then, on the Day of Resurrection, you will be disputing before your Lord.

source: فمن أظلم ممن كذب على الله وكذب بالصدق إذ جاءه أليس في جهنم مثوى للكافرين
en: Then, who does more wrong than one who utters a lie against Allah, and denies the truth [this Qur'an, the Prophet (Muhammad صلى الله عليه وسلم) and the Islamic Monotheism] when it comes to him! Is there not in Hell an abode for the disbelievers?

source: والذي جاء بالصدق وصدق به أولئك هم المتقون
en: And he (Muhammad صلى الله عليه وسلم) who has brought the truth (this Qur'an and Islamic Monotheism) and (those who) believed therein (i.e. the true believers of Islamic Monotheism), those are Al-Muttaqun (the pious - See V.2:2).

source: لهم ما يشاءون عند ربهم ذلك جزاء المحسنين
en: They shall have all that they will desire with their Lord. That is the reward of Muhsinun (good-doers - see the footnote of V.9:120).

source: ليكفر الله عنهم أسوأ الذي عملوا ويجزيهم أجرهم بأحسن الذي كانوا يعملون
en: So that Allah may expiate from them the evil of what they did and give them the reward, according to the best of what they used to do.

source: أليس الله بكاف عبده ويخوفونك بالذين من دونه ومن يضلل الله فما له من هاد
en: Is not Allah Sufficient for His slave? Yet they try to frighten you with those (whom they worship) besides Him! And whom Allah sends astray, for him there will be no guide.

source: ومن يهد الله فما له من مضل أليس الله بعزيز ذي انتقام
en: And whomsoever Allah guides, for him there will be no misleader. Is not Allah All-Mighty, Possessor of Retribution?

source: ولئن سألتهم من خلق السماوات والأرض ليقولن الله قل أفرأيتم ما تدعون من دون الله إن أرادني الله بضر هل هن كاشفات ضره أو أرادني برحمة هل هن ممسكات رحمته قل حسبي الله عليه يتوكل المتوكلون
en: And verily, if you ask them: "Who created the heavens and the earth?" Surely they will say: "Allah (has created them)." Say: "Tell me then, the things that you invoke besides Allah - if Allah intended some harm for me, could they remove His harm? Or if He (Allah) intended some mercy for me, could they withhold His Mercy?" Say: "Sufficient for me is Allah; in Him those who trust (i.e. believers) must put their trust. "

source: قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون
en: Say: (O Muhammad صلى الله عليه وسلم) "O My people! Work according to your way, I am working (according to my way). Then you will come to know

source: من يأتيه عذاب يخزيه ويحل عليه عذاب مقيم
en: "To whom comes a disgracing torment, and on whom descends an everlasting torment."

source: إنا أنزلنا عليك الكتاب للناس بالحق فمن اهتدى فلنفسه ومن ضل فإنما يضل عليها وما أنت عليهم بوكيل
en: Verily, We have sent down to you (O Muhammad صلى الله عليه وسلم) the Book (this Qur'an) for mankind in truth. So whosoever accepts the guidance, it is only for his ownself, and whosoever goes astray, he goes astray only for his (own) loss. And you (O Muhammad صلى الله عليه وسلم) are not a Wakil (trustee or disposer of affairs, or guardian) over them.

source: الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضى عليها الموت ويرسل الأخرى إلى أجل مسمى إن في ذلك لآيات لقوم يتفكرون
en: It is Allah Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.

source: أم اتخذوا من دون الله شفعاء قل أولو كانوا لا يملكون شيئا ولا يعقلون
en: Have they taken (others) as intercessors besides Allah? Say: "Even if they have power over nothing whatever and have no intelligence?"

source: قل لله الشفاعة جميعا له ملك السماوات والأرض ثم إليه ترجعون
en: Say: "To Allah belongs all intercession. His is the Sovereignty of the heavens and the earth. Then to Him you shall be brought back."

source: وإذا ذكر الله وحده اشمأزت قلوب الذين لا يؤمنون بالآخرة وإذا ذكر الذين من دونه إذا هم يستبشرون
en: And when Allah Alone is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust (from the Oneness of Allah توحيد الله) and when those (whom they obey or worship) besides Him [like all false deities other than Allah, - it may be a Messenger, an angel, a pious man, a jinni, or any other creature even idols, graves of religious people, saints, priests, monks and others.] are mentioned, behold, they rejoice!

source: قل اللهم فاطر السماوات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك في ما كانوا فيه يختلفون
en: Say (O Muhammad صلى الله عليه وسلم): "O Allah! Creator of the heavens and the earth! All-Knower of the Ghaib (Unseen) and the seen! You will judge between your slaves about that wherein they used to differ."

source: ولو أن للذين ظلموا ما في الأرض جميعا ومثله معه لافتدوا به من سوء العذاب يوم القيامة وبدا لهم من الله ما لم يكونوا يحتسبون
en: And those who did wrong (the polytheists and disbelievers in the Oneness of Allah), if they had all that is in earth and therewith as much again, they verily, would offer it to ransom themselves therewith on the Day of Resurrection from the evil torment; and there will become apparent to them from Allah what they had not been reckoning.

source: وبدا لهم سيئات ما كسبوا وحاق بهم ما كانوا به يستهزئون
en: And the evils of that which they earned will become apparent to them, and that which they used to mock at will encircle them.

source: فإذا مس الإنسان ضر دعانا ثم إذا خولناه نعمة منا قال إنما أوتيته على علم بل هي فتنة ولكن أكثرهم لا يعلمون
en: When harm touches man, he calls to Us (for help); then when We have (rescued him from that harm and) changed it into a favour from Us, he says: "Only because of knowledge (that I possess) I obtained it." Nay, it is only a trial, but most of them know not!

source: قد قالها الذين من قبلهم فما أغنى عنهم ما كانوا يكسبون
en: Verily, those before them said it, yet (all) that they had earned availed them not.

source: فأصابهم سيئات ما كسبوا والذين ظلموا من هؤلاء سيصيبهم سيئات ما كسبوا وما هم بمعجزين
en: So, the evil results of that which they earned overtook them. And those who did wrong of these [people to whom you (Muhammad صلى الله عليه وسلم) have been sent] will also be overtaken by the evil results (torment) for that which they earned; and they will never be able to escape.

source: أولم يعلموا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون
en: Do they not know that Allah enlarges the provision for whom He wills, and straitens it (for whom He wills). Verily, in this are signs for the folk who believe!

source: قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم
en: Say: "O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)! Despair not of the Mercy of Allah: verily, Allah forgives all sins. Truly He is Oft-Forgiving, Most Merciful.

source: وأنيبوا إلى ربكم وأسلموا له من قبل أن يأتيكم العذاب ثم لا تنصرون
en: "And turn in repentance and in obedience with true Faith (Islamic Monotheism) to your Lord and submit to Him (in Islam) before the torment comes upon you, (and) then you will not be helped.

source: واتبعوا أحسن ما أنزل إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون
en: "And follow the best of that which is sent down to you from your Lord (i.e. this Qur'an, do what it orders you to do and keep away from what it forbids), before the torment comes on you suddenly while you perceive not!"

source: أن تقول نفس يا حسرتا على ما فرطت في جنب الله وإن كنت لمن الساخرين
en: Lest a person should say: "Alas, my grief that I was undutiful to Allah (i.e. I have not done what Allah has ordered me to do), and I was indeed among those who mocked [at the truth! i.e. La ilaha illallah (none has the right to be worshipped but Allah), the Qur'an, and Muhammad صلى الله عليه وسلم and at the faithful believers]

source: أو تقول لو أن الله هداني لكنت من المتقين
en: Or (lest) he should say: "If only Allah had guided me, I should indeed have been among the Muttaqun (the pious - See V.2:2)."

source: أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين
en: Or (lest) he should say when he sees the torment: "If only I had another chance (to return to the world), then I should indeed be among the Muhsinun (good-doers - See V.2:112)."

source: بلى قد جاءتك آياتي فكذبت بها واستكبرت وكنت من الكافرين
en: Yes! Verily, there came to you My Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and you denied them, and were proud and were among the disbelievers.

source: ويوم القيامة ترى الذين كذبوا على الله وجوههم مسودة أليس في جهنم مثوى للمتكبرين
en: And on the Day of Resurrection you will see those who lied against Allah (i.e. attributed to Him sons, partners) - their faces will be black. Is there not in Hell an abode for the arrogant?

source: وينجي الله الذين اتقوا بمفازتهم لا يمسهم السوء ولا هم يحزنون
en: And Allah will deliver those who are the Muttaqun (the pious - See V.2:2) to their places of success (Paradise). Evil shall touch them not, nor shall they grieve.

source: الله خالق كل شيء وهو على كل شيء وكيل
en: Allah is the Creator of all things, and He is the Wakil (Trustee, Disposer of affairs, Guardian) over all things.

source: له مقاليد السماوات والأرض والذين كفروا بآيات الله أولئك هم الخاسرون
en: To Him belong the keys of the heavens and the earth. And those who disbelieve in the Ayat (proofs, evidence, verses, signs, revelations, etc.) of Allah, such are they who will be the losers.

source: قل أفغير الله تأمروني أعبد أيها الجاهلون
en: Say (O Muhammad صلى الله عليه وسلم to the polytheists): "Do you order me to worship other than Allah? O you fools!"
